RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/src/bl602_glb.c
        case GLB_PLL_XTAL_26M:
            SystemCoreClockSet(26000000);
            break;

        case GLB_PLL_XTAL_RC32M:
            SystemCoreClockSet(32000000);
            break;

        default:
            break;
    }

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  Set System clock
 *
 * @param  xtalType: XTAL frequency type
 * @param  clkFreq: clock frequency selection
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_CLOCK_SECTION GLB_Set_System_CLK(GLB_PLL_XTAL_Type xtalType, GLB_SYS_CLK_Type clkFreq)
{
    uint32_t tmpVal;

    CHECK_PARAM(IS_GLB_PLL_XTAL_TYPE(xtalType));
    CHECK_PARAM(IS_GLB_SYS_CLK_TYPE(clkFreq));

    /* reg_bclk_en = reg_hclk_en = reg_fclk_en = 1, cannot be zero */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_CLK_CFG0);
    tmpVal = BL_SET_REG_BIT(tmpVal, GLB_REG_BCLK_EN);
    tmpVal = BL_SET_REG_BIT(tmpVal, GLB_REG_HCLK_EN);
    tmpVal = BL_SET_REG_BIT(tmpVal, GLB_REG_FCLK_EN);
    BL_WR_REG(GLB_BASE, GLB_CLK_CFG0, tmpVal);

    /* Before config XTAL and PLL ,make sure root clk is from RC32M */
    HBN_Set_ROOT_CLK_Sel(HBN_ROOT_CLK_RC32M);
    GLB_Set_System_CLK_Div(0, 0);
    SystemCoreClockSet(32 * 1000 * 1000);

    /* Select PKA clock from hclk */
    GLB_Set_PKA_CLK_Sel(GLB_PKA_CLK_HCLK);

    if (xtalType == GLB_PLL_XTAL_NONE) {
        if (clkFreq == GLB_SYS_CLK_RC32M) {
            return SUCCESS;
        } else {
            return ERROR;
        }
    }

    if (xtalType != GLB_PLL_XTAL_RC32M) {
        /* power on xtal first */
        AON_Power_On_XTAL();
    }

    /* always power up PLL and enable all PLL clock output */
    PDS_Power_On_PLL((PDS_PLL_XTAL_Type)xtalType);
    BL602_Delay_US(55);
    PDS_Enable_PLL_All_Clks();

    /* reg_pll_en = 1, cannot be zero */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_CLK_CFG0);
    tmpVal = BL_SET_REG_BIT(tmpVal, GLB_REG_PLL_EN);
    BL_WR_REG(GLB_BASE, GLB_CLK_CFG0, tmpVal);

    /* select pll output clock before select root clock */
    if (clkFreq >= GLB_SYS_CLK_PLL48M) {
        tmpVal = BL_RD_REG(GLB_BASE, GLB_CLK_CFG0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_REG_PLL_SEL, clkFreq - GLB_SYS_CLK_PLL48M);
        BL_WR_REG(GLB_BASE, GLB_CLK_CFG0, tmpVal);
    }

    /* select root clock */
    switch (clkFreq) {
        case GLB_SYS_CLK_RC32M:
            break;

        case GLB_SYS_CLK_XTAL:
            HBN_Set_ROOT_CLK_Sel(HBN_ROOT_CLK_XTAL);
            Update_SystemCoreClockWith_XTAL(xtalType);
            break;

        case GLB_SYS_CLK_PLL48M:
            HBN_Set_ROOT_CLK_Sel(HBN_ROOT_CLK_PLL);
            SystemCoreClockSet(48 * 1000 * 1000);
            break;

        case GLB_SYS_CLK_PLL120M:
            GLB_Set_System_CLK_Div(0, 1);
            HBN_Set_ROOT_CLK_Sel(HBN_ROOT_CLK_PLL);
            SystemCoreClockSet(120 * 1000 * 1000);
            break;

        case GLB_SYS_CLK_PLL160M:
            L1C_IROM_2T_Access_Set(ENABLE);
            GLB_Set_System_CLK_Div(0, 1);
            HBN_Set_ROOT_CLK_Sel(HBN_ROOT_CLK_PLL);
            SystemCoreClockSet(160 * 1000 * 1000);
            break;

        case GLB_SYS_CLK_PLL192M:
            L1C_IROM_2T_Access_Set(ENABLE);
            GLB_Set_System_CLK_Div(0, 1);
            HBN_Set_ROOT_CLK_Sel(HBN_ROOT_CLK_PLL);
            SystemCoreClockSet(192 * 1000 * 1000);
            break;

        default:
            break;
    }

    GLB_CLK_SET_DUMMY_WAIT;

    /* select PKA clock from 120M since we power up PLL */
    GLB_Set_PKA_CLK_Sel(GLB_PKA_CLK_PLL120M);

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  This is demo for user that use RC32M as default bootup clock instead of PLL,when APP is
 *         started, this function can be called to set PLL to 160M
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_CLOCK_SECTION System_Core_Clock_Update_From_RC32M(void)
{
    SF_Ctrl_Cfg_Type sfCtrlCfg = {
        .owner = SF_CTRL_OWNER_IAHB,
        .clkDelay = 1,
        .clkInvert = 1,
        .rxClkInvert = 1,
        .doDelay = 0,
        .diDelay = 0,
        .oeDelay = 0,
    };
    /* Use RC32M as PLL ref source to set up PLL to 160M */
    GLB_Set_System_CLK(GLB_PLL_XTAL_RC32M, GLB_SYS_CLK_PLL160M);
    /* Flash controller also need changes since system (bus) clock changed */
    SF_Ctrl_Enable(&sfCtrlCfg);
    __NOP();
    __NOP();
    __NOP();
    __NOP();

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  set BLE clock
 *
 * @param  enable: Enable or disable BLE clock
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_Set_BLE_CLK(uint8_t enable)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_CLK_CFG1);

    if (enable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, GLB_BLE_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_BLE_EN);
    }

    BL_WR_REG(GLB_BASE, GLB_CLK_CFG1, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set wifi core clock divider
 *
 * @param  clkDiv: divider
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_Set_WiFi_Core_CLK(uint8_t clkDiv)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM((clkDiv <= 0x3));

    tmpVal = BL_RD_REG(GLB_BASE, GLB_CLK_CFG1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_WIFI_MAC_CORE_DIV, clkDiv);
    BL_WR_REG(GLB_BASE, GLB_CLK_CFG1, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set wifi encryption clock
 *
 * @param  clkDiv: divider
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_Set_WiFi_Encrypt_CLK(uint8_t clkDiv)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM((clkDiv <= 0x3));

    tmpVal = BL_RD_REG(GLB_BASE, GLB_CLK_CFG1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_WIFI_MAC_WT_DIV, clkDiv);
    BL_WR_REG(GLB_BASE, GLB_CLK_CFG1, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set DMA clock
 *
 * @param  enable: Enable or disable BLE clock
 * @param  clk: DMA clock type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_Set_DMA_CLK(uint8_t enable, GLB_DMA_CLK_ID_Type clk)
{
    uint32_t tmpVal;
    uint32_t tmpVal2;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_CLK_CFG2);
    tmpVal2 = BL_GET_REG_BITS_VAL(tmpVal, GLB_DMA_CLK_EN);

    if (enable) {
        tmpVal2 |= (1 << clk);
    } else {
        tmpVal2 &= (~(1 << clk));
    }

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DMA_CLK_EN, tmpVal2);
    BL_WR_REG(GLB_BASE, GLB_CLK_CFG2, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set IR clock divider
 *
 * @param  enable: enable or disable IR clock
 * @param  clkSel: IR clock type
 * @param  div: divider
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_Set_IR_CLK(uint8_t enable, GLB_IR_CLK_SRC_Type clkSel, uint8_t div)
{
    uint32_t tmpVal = 0;

